const ru = {
  translation: {
    geolocator: 'Geolocator',
    locations: 'Список локаций',
    location: 'Местоположение',
    locationCard: 'Подробнее',
    toLocationsPagePath: 'К локациям',
    add: 'Добавить',
    country: 'Страна',
    province: 'Область',
    locality: 'Город',
    street: 'Улица',
    house: 'Дом',
    city: 'Город',
    countries: 'Страны',
    welcomePage: 'На главную',
    cities: 'Города',
    id: 'ID',
    coordinates: 'Координаты локации',
    otherDetails: 'Особенности локации',
    createDate: 'Дата создания',
    addLocation: 'Добавить локацию',
    locationAdding: 'Добавление задачи',
    shortAddingLocationTip: 'Введите координаты или адрес локации',
    locationAdded: 'Локация добавлена!',
    addLocationError: 'Уточните введенные данные!',
    welcome: {
      title: 'Around the World!',
      body: 'Сервис по нахождению местоположения локации. Более подробно можно узнать нажав кнопку ниже:)',
      buttonText: 'Узнать Больше',
    },
    notFound: {
      header: 'Страница не найдена',
      message: 'Но вы можете перейти ',
      linkText: 'на главную страницу',
    },
    about: {
      header: 'Инструкции по использованию сервиса:',
      firstTip: '1) На панели навигации вверху перейдите на страницу "Список локаций". На этой странице можно посмотреть'
        + ' какие локации уже были добавлены или добавить свою, нажав на кнопку "Добавить локацию".',
      secondTip: '2) Есть два способа поиска:',
      firstSearchWay: 'По координатам: должны быть в формате "44.44 33.33", между двумя координатами должен быть пробел.'
        + 'Количество цифр после точки может быть любым.',
      secondSearchWay: 'По текстовому названию: должно быть указано в максимально точном формате, иначе добавление не произойдет.'
        + 'Пример: кирово-чепецксосновая22к2. Пробелы между частями локации необязательны.',
    },
  },
};

export default ru;
